In [3]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [4]:
de = pd.read_csv('data16.csv')
de.head()

     Name  Age  Salary Stream            Work
0   Harry   23    5000      A          Doctor
1    Atom   22    1000      A      IT analyst
2   Moses   26    2000      C        Engineer
3   Linda   22    2000      B       Secretary
4  Ogwang   21    4000      C  Senior Manager

In [ ]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.neighbors import KNeighborsRegressor

Age,Salaryalary = de,de['Salary']